[Killed] MethodExpression
features/auth/api/register.ts:7:11
 
 export const registerSchema = loginSchema.merge(
   z.object({
-    name: z.string().min(2, 'prenom trop court').max(20, 'trop long'),
+    name: z.string().max(2, 'prenom trop court').max(20, 'trop long'),
   }),
 );
killedBy: register function should validate the schema for too short name
statusReason: expected true to be false // Object.is equality

[Survived] MethodExpression
features/auth/api/register.ts:7:11
 
 export const registerSchema = loginSchema.merge(
   z.object({
-    name: z.string().min(2, 'prenom trop court').max(20, 'trop long'),
+    name: z.string().min(2, 'prenom trop court').min(20, 'trop long'),
   }),
 );

[NoCoverage] BlockStatement
features/auth/api/register.ts:13:62
 
 export type RegisterFormData = z.infer<typeof registerSchema>;
 
-export const register = async (payload: RegisterFormData) => {
-  const response = await httpClient.post('/auth/register', payload);
-  return response.data;
-};
+export const register = async (payload: RegisterFormData) => {};
 

[NoCoverage] StringLiteral
features/auth/api/register.ts:14:42
 export type RegisterFormData = z.infer<typeof registerSchema>;
 
 export const register = async (payload: RegisterFormData) => {
-  const response = await httpClient.post('/auth/register', payload);
+  const response = await httpClient.post("", payload);
   return response.data;
 };
