[NoCoverage] ArrowFunction
src/App.vue:6:44
 import { useRoute } from 'vue-router';
 import { inject } from 'vue';
 
-const DefaultLayout = defineAsyncComponent(() =>
-  import('./layouts/DefaultLayout.vue')
+const DefaultLayout = defineAsyncComponent(() => undefined
 )
 const LoggedLayout = defineAsyncComponent(() =>

[NoCoverage] ArrowFunction
src/App.vue:9:43
 const DefaultLayout = defineAsyncComponent(() =>
   import('./layouts/DefaultLayout.vue')
 )
-const LoggedLayout = defineAsyncComponent(() =>
-  import('./layouts/LoggedLayout.vue')
+const LoggedLayout = defineAsyncComponent(() => undefined
 )
 const route = useRoute();
