[NoCoverage] BooleanLiteral
src/composables/usePromise.ts:4:25
 import { onMounted, ref, type Ref } from 'vue';
 
 const usePromise = <T>(callback: () => Promise<T>) => {
-  const isLoading = ref(false);
+  const isLoading = ref(true);
   const data = ref<T | null>(null);
   const error = ref<string | null>(null);

[NoCoverage] BlockStatement
src/composables/usePromise.ts:8:19
   const data = ref<T | null>(null);
   const error = ref<string | null>(null);
 
-  onMounted(() => {
-    isLoading.value = true;
-    error.value = null;
-
-    callback()
-      .then((response) => {
-        console.log(data);
-        data.value = response;
-      })
-      .catch((err: unknown) => {
-        if (err instanceof Error) {
-          error.value = err.message;
-        } else if (typeof err === 'string') {
-          error.value = err;
-        } else {
-          error.value = 'Une erreur est survenue';
-        }
-      })
-      .finally(() => {
-        isLoading.value = false;
-      });
-  });
+  onMounted(() => {});
 
   return {

[NoCoverage] BooleanLiteral
src/composables/usePromise.ts:9:23
   const error = ref<string | null>(null);
 
   onMounted(() => {
-    isLoading.value = true;
+    isLoading.value = false;
     error.value = null;
 

[NoCoverage] BlockStatement
src/composables/usePromise.ts:13:27
     error.value = null;
 
     callback()
-      .then((response) => {
-        console.log(data);
-        data.value = response;
-      })
+      .then((response) => {})
       .catch((err: unknown) => {
         if (err instanceof Error) {

[NoCoverage] BlockStatement
src/composables/usePromise.ts:17:32
         console.log(data);
         data.value = response;
       })
-      .catch((err: unknown) => {
-        if (err instanceof Error) {
-          error.value = err.message;
-        } else if (typeof err === 'string') {
-          error.value = err;
-        } else {
-          error.value = 'Une erreur est survenue';
-        }
-      })
+      .catch((err: unknown) => {})
       .finally(() => {
         isLoading.value = false;

[NoCoverage] ConditionalExpression
src/composables/usePromise.ts:18:13
         data.value = response;
       })
       .catch((err: unknown) => {
-        if (err instanceof Error) {
+        if (true) {
           error.value = err.message;
         } else if (typeof err === 'string') {

[NoCoverage] ConditionalExpression
src/composables/usePromise.ts:18:13
         data.value = response;
       })
       .catch((err: unknown) => {
-        if (err instanceof Error) {
+        if (false) {
           error.value = err.message;
         } else if (typeof err === 'string') {

[NoCoverage] ConditionalExpression
src/composables/usePromise.ts:20:20
       .catch((err: unknown) => {
         if (err instanceof Error) {
           error.value = err.message;
-        } else if (typeof err === 'string') {
+        } else if (false) {
           error.value = err;
         } else {

[NoCoverage] EqualityOperator
src/composables/usePromise.ts:20:20
       .catch((err: unknown) => {
         if (err instanceof Error) {
           error.value = err.message;
-        } else if (typeof err === 'string') {
+        } else if (typeof err !== 'string') {
           error.value = err;
         } else {

[NoCoverage] BlockStatement
src/composables/usePromise.ts:22:16
           error.value = err.message;
         } else if (typeof err === 'string') {
           error.value = err;
-        } else {
-          error.value = 'Une erreur est survenue';
-        }
+        } else {}
       })
       .finally(() => {

[NoCoverage] StringLiteral
src/composables/usePromise.ts:23:25
         } else if (typeof err === 'string') {
           error.value = err;
         } else {
-          error.value = 'Une erreur est survenue';
+          error.value = "";
         }
       })

[NoCoverage] BlockStatement
src/composables/usePromise.ts:26:22
           error.value = 'Une erreur est survenue';
         }
       })
-      .finally(() => {
-        isLoading.value = false;
-      });
+      .finally(() => {});
   });
 

[NoCoverage] BooleanLiteral
src/composables/usePromise.ts:27:27
         }
       })
       .finally(() => {
-        isLoading.value = false;
+        isLoading.value = true;
       });
   });
