[Survived] ArrowFunction
src/modules/http-client.ts:9:3
 });
 
 httpClient.interceptors.response.use(
-  (success) => success,
+  () => undefined,
   (error) => {
     if (error.response?.status === 401 || error.response?.status === 403) {

[NoCoverage] BlockStatement
src/modules/http-client.ts:10:14
 
 httpClient.interceptors.response.use(
   (success) => success,
-  (error) => {
-    if (error.response?.status === 401 || error.response?.status === 403) {
-      const authStore = useAuthStore();
-      const refreshToken = authStore.refreshToken;
-
-      if (refreshToken) {
-        return refresh(refreshToken).then((token) => {
-          if (token) {
-            authStore.setTokens(token, refreshToken);
-            error.config.headers.Authorization = `Bearer ${token}`;
-            return axios.request(error.config);
-          }
-        });
-      }
-    }
-
-    return Promise.reject(error);
-  },
+  (error) => {},
 );
 

[NoCoverage] OptionalChaining
src/modules/http-client.ts:11:9
 httpClient.interceptors.response.use(
   (success) => success,
   (error) => {
-    if (error.response?.status === 401 || error.response?.status === 403) {
+    if (error.response.status === 401 || error.response?.status === 403) {
       const authStore = useAuthStore();
       const refreshToken = authStore.refreshToken;

[NoCoverage] BlockStatement
src/modules/http-client.ts:11:75
 httpClient.interceptors.response.use(
   (success) => success,
   (error) => {
-    if (error.response?.status === 401 || error.response?.status === 403) {
-      const authStore = useAuthStore();
-      const refreshToken = authStore.refreshToken;
-
-      if (refreshToken) {
-        return refresh(refreshToken).then((token) => {
-          if (token) {
-            authStore.setTokens(token, refreshToken);
-            error.config.headers.Authorization = `Bearer ${token}`;
-            return axios.request(error.config);
-          }
-        });
-      }
-    }
+    if (error.response?.status === 401 || error.response?.status === 403) {}
 
     return Promise.reject(error);

[NoCoverage] BlockStatement
src/modules/http-client.ts:15:25
       const authStore = useAuthStore();
       const refreshToken = authStore.refreshToken;
 
-      if (refreshToken) {
-        return refresh(refreshToken).then((token) => {
-          if (token) {
-            authStore.setTokens(token, refreshToken);
-            error.config.headers.Authorization = `Bearer ${token}`;
-            return axios.request(error.config);
-          }
-        });
-      }
+      if (refreshToken) {}
     }
 

[NoCoverage] ConditionalExpression
src/modules/http-client.ts:15:11
       const authStore = useAuthStore();
       const refreshToken = authStore.refreshToken;
 
-      if (refreshToken) {
+      if (false) {
         return refresh(refreshToken).then((token) => {
           if (token) {

[NoCoverage] BlockStatement
src/modules/http-client.ts:16:54
       const refreshToken = authStore.refreshToken;
 
       if (refreshToken) {
-        return refresh(refreshToken).then((token) => {
-          if (token) {
-            authStore.setTokens(token, refreshToken);
-            error.config.headers.Authorization = `Bearer ${token}`;
-            return axios.request(error.config);
-          }
-        });
+        return refresh(refreshToken).then((token) => {});
       }
     }

[NoCoverage] ConditionalExpression
src/modules/http-client.ts:17:15
 
       if (refreshToken) {
         return refresh(refreshToken).then((token) => {
-          if (token) {
+          if (false) {
             authStore.setTokens(token, refreshToken);
             error.config.headers.Authorization = `Bearer ${token}`;

[NoCoverage] BlockStatement
src/modules/http-client.ts:17:22
 
       if (refreshToken) {
         return refresh(refreshToken).then((token) => {
-          if (token) {
-            authStore.setTokens(token, refreshToken);
-            error.config.headers.Authorization = `Bearer ${token}`;
-            return axios.request(error.config);
-          }
+          if (token) {}
         });
       }

[NoCoverage] BlockStatement
src/modules/http-client.ts:30:49
   },
 );
 
-httpClient.interceptors.request.use((config) => {
-  const authStore = useAuthStore();
-
-  const token = authStore.token;
-
-  if (token) {
-    config.headers.Authorization = `Bearer ${token}`;
-  }
-
-  return config;
-});
+httpClient.interceptors.request.use((config) => {});
 
 const refresh = async (refresh: string) => {

[NoCoverage] BlockStatement
src/modules/http-client.ts:35:14
 
   const token = authStore.token;
 
-  if (token) {
-    config.headers.Authorization = `Bearer ${token}`;
-  }
+  if (token) {}
 
   return config;

[NoCoverage] ConditionalExpression
src/modules/http-client.ts:35:7
 
   const token = authStore.token;
 
-  if (token) {
+  if (false) {
     config.headers.Authorization = `Bearer ${token}`;
   }

[NoCoverage] StringLiteral
src/modules/http-client.ts:36:36
   const token = authStore.token;
 
   if (token) {
-    config.headers.Authorization = `Bearer ${token}`;
+    config.headers.Authorization = ``;
   }
 

[NoCoverage] BlockStatement
src/modules/http-client.ts:42:44
   return config;
 });
 
-const refresh = async (refresh: string) => {
-  let accessToken = '';
-
-  const params = { refreshToken: refresh };
-
-  try {
-    const response = await axios.post(
-      `https://c7fd-90-58-170-121.ngrok-free.app/auth/refresh-token`,
-      params,
-    );
-
-    accessToken = response.data.accessToken;
-    console.log('Token Refreshed');
-  } catch (error) {
-    console.log(error);
-  } finally {
-    return accessToken;
-  }
-};
+const refresh = async (refresh: string) => {};
 
 export default httpClient;

[NoCoverage] StringLiteral
src/modules/http-client.ts:43:21
 });
 
 const refresh = async (refresh: string) => {
-  let accessToken = '';
+  let accessToken = "Stryker was here!";
 
   const params = { refreshToken: refresh };

[NoCoverage] BlockStatement
src/modules/http-client.ts:47:7
 
   const params = { refreshToken: refresh };
 
-  try {
-    const response = await axios.post(
-      `https://c7fd-90-58-170-121.ngrok-free.app/auth/refresh-token`,
-      params,
-    );
-
-    accessToken = response.data.accessToken;
-    console.log('Token Refreshed');
-  } catch (error) {
+  try {} catch (error) {
     console.log(error);
   } finally {

[NoCoverage] StringLiteral
src/modules/http-client.ts:49:7
 
   try {
     const response = await axios.post(
-      `https://c7fd-90-58-170-121.ngrok-free.app/auth/refresh-token`,
+      ``,
       params,
     );

[NoCoverage] StringLiteral
src/modules/http-client.ts:54:17
     );
 
     accessToken = response.data.accessToken;
-    console.log('Token Refreshed');
+    console.log("");
   } catch (error) {
     console.log(error);

[NoCoverage] BlockStatement
src/modules/http-client.ts:55:19
 
     accessToken = response.data.accessToken;
     console.log('Token Refreshed');
-  } catch (error) {
-    console.log(error);
-  } finally {
+  } catch (error) {} finally {
     return accessToken;
   }

[NoCoverage] BlockStatement
src/modules/http-client.ts:57:13
     console.log('Token Refreshed');
   } catch (error) {
     console.log(error);
-  } finally {
-    return accessToken;
-  }
+  } finally {}
 };
 
