[NoCoverage] ArrowFunction
src/Demo.vue:5:23
 import { useRoute } from 'vue-router';
 
 
-const DefaultLayout = () => import('./layouts/DefaultLayout.vue');
+const DefaultLayout = () => undefined;
 
 const route = useRoute();
