[NoCoverage] BlockStatement
src/pages/auth/login.vue:17:40
 
 const [zodPlugin, submitHandler] = createZodPlugin(
     loginSchema,
-    async (formData: LoginFormData) => {
-        login(formData).then((data) => {
-            setTokens(data.accessToken, data.refreshToken)
-            router.push({
-                name: 'home',
-                params: {
-                    id: data.id
-                }
-            })
-        }).catch((err) => {
-            error.value = handleError(err)
-        }).finally(() => {
-            isLoading.value = false
-        })
-    }
+    async (formData: LoginFormData) => {}
 )
 

[NoCoverage] BlockStatement
src/pages/auth/login.vue:18:40
 const [zodPlugin, submitHandler] = createZodPlugin(
     loginSchema,
     async (formData: LoginFormData) => {
-        login(formData).then((data) => {
-            setTokens(data.accessToken, data.refreshToken)
-            router.push({
-                name: 'home',
-                params: {
-                    id: data.id
-                }
-            })
-        }).catch((err) => {
+        login(formData).then((data) => {}).catch((err) => {
             error.value = handleError(err)
         }).finally(() => {

[NoCoverage] BlockStatement
src/pages/auth/login.vue:26:27
                     id: data.id
                 }
             })
-        }).catch((err) => {
-            error.value = handleError(err)
-        }).finally(() => {
+        }).catch((err) => {}).finally(() => {
             isLoading.value = false
         })
