[NoCoverage] BlockStatement
src/pages/auth/register.vue:16:43
 
 const [zodPlugin, submitHandler] = createZodPlugin(
     registerSchema,
-    async (formData: RegisterFormData) => {
-        register(formData).then(() => {
-            router.push('/')
-        }).catch((err) => {
-            error.value = handleError(err)
-        }).finally(() => {
-            isLoading.value = false
-        })
-    }
+    async (formData: RegisterFormData) => {}
 )
 </script>

[NoCoverage] BlockStatement
src/pages/auth/register.vue:17:39
 const [zodPlugin, submitHandler] = createZodPlugin(
     registerSchema,
     async (formData: RegisterFormData) => {
-        register(formData).then(() => {
-            router.push('/')
-        }).catch((err) => {
+        register(formData).then(() => {}).catch((err) => {
             error.value = handleError(err)
         }).finally(() => {
