[NoCoverage] ArrowFunction
features/products/api/delete-product.ts:5:17
 import { useMutation, useQueryClient } from '@tanstack/vue-query';
 import type { Product } from './useProducts';
 
-const waitFor = (ms: number) => new Promise((r) => setTimeout(r, ms));
+const waitFor = () => undefined;
 
 const deleteProduct = async (id: string): Promise<void> => {

[NoCoverage] ArrowFunction
features/products/api/delete-product.ts:5:45
 import { useMutation, useQueryClient } from '@tanstack/vue-query';
 import type { Product } from './useProducts';
 
-const waitFor = (ms: number) => new Promise((r) => setTimeout(r, ms));
+const waitFor = (ms: number) => new Promise(() => undefined);
 
 const deleteProduct = async (id: string): Promise<void> => {

[NoCoverage] BlockStatement
features/products/api/delete-product.ts:7:60
 
 const waitFor = (ms: number) => new Promise((r) => setTimeout(r, ms));
 
-const deleteProduct = async (id: string): Promise<void> => {
-  await waitFor(2000);
-  await httpClient.delete(`/products/${id}`);
-};
+const deleteProduct = async (id: string): Promise<void> => {};
 
 export const useDeleteProduct = () => {

[NoCoverage] StringLiteral
features/products/api/delete-product.ts:9:27
 
 const deleteProduct = async (id: string): Promise<void> => {
   await waitFor(2000);
-  await httpClient.delete(`/products/${id}`);
+  await httpClient.delete(``);
 };
 

[NoCoverage] BlockStatement
features/products/api/delete-product.ts:16:37
   const queryClient = useQueryClient();
   return useMutation({
     mutationFn: deleteProduct,
-    onMutate: async (id: string) => {
-      await queryClient.cancelQueries({ queryKey: ['products'] });
-
-      const previousProducts = queryClient.getQueryData(['products']);
-
-      queryClient.setQueryData(['products'], (old: Product[] | undefined) => {
-        if (!old) {
-          return [];
-        }
-        return old.filter((product) => product._id !== id);
-      });
-
-      return { previousProducts };
-    },
+    onMutate: async (id: string) => {},
     onSuccess: () => {
       queryClient.invalidateQueries({

[NoCoverage] StringLiteral
features/products/api/delete-product.ts:17:52
   return useMutation({
     mutationFn: deleteProduct,
     onMutate: async (id: string) => {
-      await queryClient.cancelQueries({ queryKey: ['products'] });
+      await queryClient.cancelQueries({ queryKey: [""] });
 
       const previousProducts = queryClient.getQueryData(['products']);

[NoCoverage] ObjectLiteral
features/products/api/delete-product.ts:17:39
   return useMutation({
     mutationFn: deleteProduct,
     onMutate: async (id: string) => {
-      await queryClient.cancelQueries({ queryKey: ['products'] });
+      await queryClient.cancelQueries({});
 
       const previousProducts = queryClient.getQueryData(['products']);

[NoCoverage] ArrayDeclaration
features/products/api/delete-product.ts:19:57
     onMutate: async (id: string) => {
       await queryClient.cancelQueries({ queryKey: ['products'] });
 
-      const previousProducts = queryClient.getQueryData(['products']);
+      const previousProducts = queryClient.getQueryData([]);
 
       queryClient.setQueryData(['products'], (old: Product[] | undefined) => {

[NoCoverage] BlockStatement
features/products/api/delete-product.ts:21:78
 
       const previousProducts = queryClient.getQueryData(['products']);
 
-      queryClient.setQueryData(['products'], (old: Product[] | undefined) => {
-        if (!old) {
-          return [];
-        }
-        return old.filter((product) => product._id !== id);
-      });
+      queryClient.setQueryData(['products'], (old: Product[] | undefined) => {});
 
       return { previousProducts };

[NoCoverage] StringLiteral
features/products/api/delete-product.ts:21:33
 
       const previousProducts = queryClient.getQueryData(['products']);
 
-      queryClient.setQueryData(['products'], (old: Product[] | undefined) => {
+      queryClient.setQueryData([""], (old: Product[] | undefined) => {
         if (!old) {
           return [];

[NoCoverage] BooleanLiteral
features/products/api/delete-product.ts:22:13
       const previousProducts = queryClient.getQueryData(['products']);
 
       queryClient.setQueryData(['products'], (old: Product[] | undefined) => {
-        if (!old) {
+        if (old) {
           return [];
         }

[NoCoverage] BlockStatement
features/products/api/delete-product.ts:22:19
       const previousProducts = queryClient.getQueryData(['products']);
 
       queryClient.setQueryData(['products'], (old: Product[] | undefined) => {
-        if (!old) {
-          return [];
-        }
+        if (!old) {}
         return old.filter((product) => product._id !== id);
       });

[NoCoverage] MethodExpression
features/products/api/delete-product.ts:25:16
         if (!old) {
           return [];
         }
-        return old.filter((product) => product._id !== id);
+        return old;
       });
 

[NoCoverage] ArrowFunction
features/products/api/delete-product.ts:25:27
         if (!old) {
           return [];
         }
-        return old.filter((product) => product._id !== id);
+        return old.filter(() => undefined);
       });
 

[NoCoverage] ObjectLiteral
features/products/api/delete-product.ts:28:14
         return old.filter((product) => product._id !== id);
       });
 
-      return { previousProducts };
+      return {};
     },
     onSuccess: () => {

[NoCoverage] BlockStatement
features/products/api/delete-product.ts:30:22
 
       return { previousProducts };
     },
-    onSuccess: () => {
-      queryClient.invalidateQueries({
-        queryKey: ['products'],
-      });
-    },
+    onSuccess: () => {},
     onError: (error, variables, context) => {
       queryClient.setQueryData(['products'], context?.previousProducts);

[NoCoverage] ArrayDeclaration
features/products/api/delete-product.ts:32:19
     },
     onSuccess: () => {
       queryClient.invalidateQueries({
-        queryKey: ['products'],
+        queryKey: [],
       });
     },

[NoCoverage] BlockStatement
features/products/api/delete-product.ts:35:45
         queryKey: ['products'],
       });
     },
-    onError: (error, variables, context) => {
-      queryClient.setQueryData(['products'], context?.previousProducts);
-      queryClient.invalidateQueries({
-        queryKey: ['products'],
-      });
-    },
+    onError: (error, variables, context) => {},
   });
 };

[NoCoverage] OptionalChaining
features/products/api/delete-product.ts:36:46
       });
     },
     onError: (error, variables, context) => {
-      queryClient.setQueryData(['products'], context?.previousProducts);
+      queryClient.setQueryData(['products'], context.previousProducts);
       queryClient.invalidateQueries({
         queryKey: ['products'],

[NoCoverage] StringLiteral
features/products/api/delete-product.ts:36:33
       });
     },
     onError: (error, variables, context) => {
-      queryClient.setQueryData(['products'], context?.previousProducts);
+      queryClient.setQueryData([""], context?.previousProducts);
       queryClient.invalidateQueries({
         queryKey: ['products'],

[NoCoverage] ObjectLiteral
features/products/api/delete-product.ts:37:37
     },
     onError: (error, variables, context) => {
       queryClient.setQueryData(['products'], context?.previousProducts);
-      queryClient.invalidateQueries({
-        queryKey: ['products'],
-      });
+      queryClient.invalidateQueries({});
     },
   });
