[Survived] StringLiteral
src/stores/auth.ts:6:3
 import { onMounted, reactive, ref, watch } from 'vue';
 
 const useAuthStore = defineStore(
-  'auth',
+  "",
   () => {
     const token = ref<string | null>(null);

[NoCoverage] BlockStatement
src/stores/auth.ts:13:66
     const name = ref<string | null>(null);
     const email = ref<string | null>(null);
 
-    const setTokens = (token1: string, refreshToken1: string) => {
-      token.value = token1;
-      refreshToken.value = refreshToken1;
-    };
+    const setTokens = (token1: string, refreshToken1: string) => {};
 
     watch(

[NoCoverage] ArrowFunction
src/stores/auth.ts:19:7
     };
 
     watch(
-      () => token.value,
+      () => undefined,
       (value) => {
         console.log('token', value);

[NoCoverage] BlockStatement
src/stores/auth.ts:20:18
 
     watch(
       () => token.value,
-      (value) => {
-        console.log('token', value);
-        if (value) {
-          getProfile().then((response) => {
-            name.value = response.name;
-            email.value = response.email;
-          });
-        }
-      },
+      (value) => {},
       { immediate: true },
     );

[NoCoverage] ConditionalExpression
src/stores/auth.ts:22:13
       () => token.value,
       (value) => {
         console.log('token', value);
-        if (value) {
+        if (true) {
           getProfile().then((response) => {
             name.value = response.name;

[NoCoverage] ConditionalExpression
src/stores/auth.ts:22:13
       () => token.value,
       (value) => {
         console.log('token', value);
-        if (value) {
+        if (false) {
           getProfile().then((response) => {
             name.value = response.name;

[NoCoverage] BlockStatement
src/stores/auth.ts:23:43
       (value) => {
         console.log('token', value);
         if (value) {
-          getProfile().then((response) => {
-            name.value = response.name;
-            email.value = response.email;
-          });
+          getProfile().then((response) => {});
         }
       },

[NoCoverage] ObjectLiteral
src/stores/auth.ts:29:7
           });
         }
       },
-      { immediate: true },
+      {},
     );
 

[Survived] ObjectLiteral
src/stores/auth.ts:40:3
       refreshToken,
     };
   },
-  {
-    persist: {
-      storage: localStorage,
-    },
-  },
+  {},
 );
 

[Survived] ObjectLiteral
src/stores/auth.ts:41:14
     };
   },
   {
-    persist: {
-      storage: localStorage,
-    },
+    persist: {},
   },
 );
