[NoCoverage] BlockStatement
features/products/api/useCreateProduct.ts:13:86
 
 export type CreateProductForm = z.infer<typeof productSchema>;
 
-export const createProduct = async (product: CreateProductForm): Promise<Product> => {
-  const response = await httpClient.post('/products', product);
-  return response.data;
-};
+export const createProduct = async (product: CreateProductForm): Promise<Product> => {};
 
 export const useCreateProduct = () => {

[NoCoverage] BlockStatement
features/products/api/useCreateProduct.ts:18:39
   return response.data;
 };
 
-export const useCreateProduct = () => {
-  const queryClient = useQueryClient();
-  return useMutation({
-    mutationFn: createProduct,
-    onSuccess: () => {
-      queryClient.invalidateQueries({
-        queryKey: ['products'],
-      });
-    },
-  });
-};
+export const useCreateProduct = () => {};
 

[NoCoverage] ObjectLiteral
features/products/api/useCreateProduct.ts:20:22
 
 export const useCreateProduct = () => {
   const queryClient = useQueryClient();
-  return useMutation({
-    mutationFn: createProduct,
-    onSuccess: () => {
-      queryClient.invalidateQueries({
-        queryKey: ['products'],
-      });
-    },
-  });
+  return useMutation({});
 };
 

[NoCoverage] BlockStatement
features/products/api/useCreateProduct.ts:22:22
   const queryClient = useQueryClient();
   return useMutation({
     mutationFn: createProduct,
-    onSuccess: () => {
-      queryClient.invalidateQueries({
-        queryKey: ['products'],
-      });
-    },
+    onSuccess: () => {},
   });
 };
