[NoCoverage] BlockStatement
features/products/api/useProducts.ts:11:60
   __v: number;
 };
 
-export const getProducts = async (): Promise<Product[]> => {
-  const response = await httpClient.get('/products');
-  return response.data;
-};
+export const getProducts = async (): Promise<Product[]> => {};
 
 const productsCacheConfig = {

[NoCoverage] ArithmeticOperator
features/products/api/useProducts.ts:19:14
 const productsCacheConfig = {
   queryKey: ['products'],
   queryFn: getProducts,
-  staleTime: 1000 * 60 * 5,
+  staleTime: 1000 * 60 / 5,
 };
 

[NoCoverage] ArithmeticOperator
features/products/api/useProducts.ts:19:14
 const productsCacheConfig = {
   queryKey: ['products'],
   queryFn: getProducts,
-  staleTime: 1000 * 60 * 5,
+  staleTime: 1000 / 60 * 5,
 };
 

[NoCoverage] BlockStatement
features/products/api/useProducts.ts:22:34
   staleTime: 1000 * 60 * 5,
 };
 
-export const useProducts = () => {
-  return useQuery(productsCacheConfig);
-};
+export const useProducts = () => {};
 
