[Killed] MethodExpression
features/auth/api/login.ts:6:13
 
 export const loginSchema = z.object({
   email: z.string().email(),
-  password: z.string().min(6, 'mdp trop court').max(20, 'trop long'),
+  password: z.string().max(6, 'mdp trop court').max(20, 'trop long'),
 });
 
killedBy: Validation Schema - loginSchema should pass with valid data
statusReason: expected [Function] to not throw an error but '[\n  {\n    "code": "too_big",\n    "…' was thrown

[Killed] MethodExpression
features/auth/api/login.ts:6:13
 
 export const loginSchema = z.object({
   email: z.string().email(),
-  password: z.string().min(6, 'mdp trop court').max(20, 'trop long'),
+  password: z.string().min(6, 'mdp trop court').min(20, 'trop long'),
 });
 
killedBy: Validation Schema - loginSchema should pass with valid data
statusReason: expected [Function] to not throw an error but '[\n  {\n    "code": "too_small",\n   …' was thrown

[Killed] BlockStatement
features/auth/api/login.ts:11:56
 
 export type LoginFormData = z.infer<typeof loginSchema>;
 
-export const login = async (payload: LoginFormData) => {
-  const response = await httpClient.post('/auth/login', payload);
-  return response.data;
-};
+export const login = async (payload: LoginFormData) => {};
 
killedBy: login Function should return a token with valid credentials
statusReason: expected undefined to deeply equal { token: 'fake_jwt_token' }
