[NoCoverage] BlockStatement
features/products/components/ProductsList.vue:11:36
 
 const mutation = useDeleteProduct();
 
-const deleteItem = (id: string) => {
-    mutation.mutateAsync(id);
-}
+const deleteItem = (id: string) => {}
 
 </script>
