[NoCoverage] BlockStatement
features/user/api/get-profile.ts:13:54
   refreshToken: string;
 };
 
-export const getProfile = async (): Promise<User> => {
-  const response = await httpClient.get('/auth/profile');
-  return response.data;
-};
+export const getProfile = async (): Promise<User> => {};
 
 /*
