[NoCoverage] BlockStatement
features/users/components/Step.vue:9:17
 
 const manager = useStepManager();
 
-onMounted(() => {
-    console.log('mounted')
-})
+onMounted(() => {})
 
 const [zodPlugin, submitHandler] = createZodPlugin(

[NoCoverage] StringLiteral
features/users/components/Step.vue:10:17
 const manager = useStepManager();
 
 onMounted(() => {
-    console.log('mounted')
+    console.log("")
 })
 
