[NoCoverage] StringLiteral
features/users/utils/step-manager.ts:18:17
       formInputs: [
         {
           type: 'email',
-          name: 'email',
+          name: "",
           label: 'Your email',
         },

[NoCoverage] StringLiteral
features/users/utils/step-manager.ts:22:17
           label: 'Your email',
         },
         {
-          type: 'text',
+          type: "",
           name: 'firstname',
           label: 'Your firstname',

[NoCoverage] StringLiteral
features/users/utils/step-manager.ts:24:18
         {
           type: 'text',
           name: 'firstname',
-          label: 'Your firstname',
+          label: "",
         },
         {

[NoCoverage] ObjectLiteral
features/users/utils/step-manager.ts:26:9
           name: 'firstname',
           label: 'Your firstname',
         },
-        {
-          type: 'text',
-          name: 'lastname',
-          label: 'Your lastname',
-        },
+        {},
       ],
     },

[NoCoverage] StringLiteral
features/users/utils/step-manager.ts:35:13
     },
     {
       id: 2,
-      name: 'Step 2',
+      name: "",
       formInputs: [
         {

[NoCoverage] ObjectLiteral
features/users/utils/step-manager.ts:37:9
       id: 2,
       name: 'Step 2',
       formInputs: [
-        {
-          type: 'text',
-          name: 'cuID',
-          label: 'Your cuID',
-          regex: '^[0-9]{8}$',
-        },
+        {},
       ],
     },

[NoCoverage] ArrayDeclaration
features/users/utils/step-manager.ts:48:19
     {
       id: 3,
       name: 'Step 3',
-      formInputs: [
-        {
-          type: 'text',
-          name: 'identity_entreprise',
-          label: 'Your identity_entreprise',
-        },
-      ],
+      formInputs: [],
     },
     {

[NoCoverage] ObjectLiteral
features/users/utils/step-manager.ts:49:9
       id: 3,
       name: 'Step 3',
       formInputs: [
-        {
-          type: 'text',
-          name: 'identity_entreprise',
-          label: 'Your identity_entreprise',
-        },
+        {},
       ],
     },

[NoCoverage] StringLiteral
features/users/utils/step-manager.ts:51:17
       formInputs: [
         {
           type: 'text',
-          name: 'identity_entreprise',
+          name: "",
           label: 'Your identity_entreprise',
         },

[NoCoverage] StringLiteral
features/users/utils/step-manager.ts:62:17
       formInputs: [
         {
           type: 'text',
-          name: 'demo',
+          name: "",
           label: 'Your demo',
         },

[NoCoverage] StringLiteral
features/users/utils/step-manager.ts:63:18
         {
           type: 'text',
           name: 'demo',
-          label: 'Your demo',
+          label: "",
         },
       ],

[NoCoverage] ArrowFunction
features/users/utils/step-manager.ts:70:5
   ]);
 
   watch(
-    () => route.params.step,
+    () => undefined,
     (value) => {
       console.log('value1');

[NoCoverage] BlockStatement
features/users/utils/step-manager.ts:71:16
 
   watch(
     () => route.params.step,
-    (value) => {
-      console.log('value1');
-      currentStep.value = parseInt(value as string);
-    },
+    (value) => {},
     {
       immediate: true,

[NoCoverage] StringLiteral
features/users/utils/step-manager.ts:72:19
   watch(
     () => route.params.step,
     (value) => {
-      console.log('value1');
+      console.log("");
       currentStep.value = parseInt(value as string);
     },

[NoCoverage] BooleanLiteral
features/users/utils/step-manager.ts:76:18
       currentStep.value = parseInt(value as string);
     },
     {
-      immediate: true,
+      immediate: false,
     },
   );

[NoCoverage] BlockStatement
features/users/utils/step-manager.ts:80:26
     },
   );
 
-  const nextStep = () => {
-    console.log('nextStep');
-    router.push({
-      name: 'create_user',
-      params: { id: '1', step: currentStep.value + 1 },
-    });
-    currentStep.value++;
-  };
+  const nextStep = () => {};
 
   const previousStep = () => {

[NoCoverage] ArithmeticOperator
features/users/utils/step-manager.ts:84:32
     console.log('nextStep');
     router.push({
       name: 'create_user',
-      params: { id: '1', step: currentStep.value + 1 },
+      params: { id: '1', step: currentStep.value - 1 },
     });
     currentStep.value++;

[NoCoverage] ObjectLiteral
features/users/utils/step-manager.ts:84:15
     console.log('nextStep');
     router.push({
       name: 'create_user',
-      params: { id: '1', step: currentStep.value + 1 },
+      params: {},
     });
     currentStep.value++;

[NoCoverage] UpdateOperator
features/users/utils/step-manager.ts:86:5
       name: 'create_user',
       params: { id: '1', step: currentStep.value + 1 },
     });
-    currentStep.value++;
+    currentStep.value--;
   };
 

[NoCoverage] BlockStatement
features/users/utils/step-manager.ts:89:30
     currentStep.value++;
   };
 
-  const previousStep = () => {
-    console.log('previousStep');
-    router.push({
-      name: 'create_user',
-      params: { id: '1', step: currentStep.value - 1 },
-    });
-    currentStep.value--;
-  };
+  const previousStep = () => {};
 
   const getStep = (stepId = currentStep.value) => {

[NoCoverage] ArithmeticOperator
features/users/utils/step-manager.ts:93:32
     console.log('previousStep');
     router.push({
       name: 'create_user',
-      params: { id: '1', step: currentStep.value - 1 },
+      params: { id: '1', step: currentStep.value + 1 },
     });
     currentStep.value--;

[NoCoverage] StringLiteral
features/users/utils/step-manager.ts:93:21
     console.log('previousStep');
     router.push({
       name: 'create_user',
-      params: { id: '1', step: currentStep.value - 1 },
+      params: { id: "", step: currentStep.value - 1 },
     });
     currentStep.value--;

[NoCoverage] UpdateOperator
features/users/utils/step-manager.ts:95:5
       name: 'create_user',
       params: { id: '1', step: currentStep.value - 1 },
     });
-    currentStep.value--;
+    currentStep.value++;
   };
 

[NoCoverage] BlockStatement
features/users/utils/step-manager.ts:98:51
     currentStep.value--;
   };
 
-  const getStep = (stepId = currentStep.value) => {
-    return {
-      ...globalSteps.value.find((step) => step.id === stepId),
-      zodSchema: zodGenerator(globalSteps.value[stepId - 1]),
-    };
-  };
+  const getStep = (stepId = currentStep.value) => {};
 
   const handleSubmit = (data: any) => {

[NoCoverage] ConditionalExpression
features/users/utils/step-manager.ts:100:43
 
   const getStep = (stepId = currentStep.value) => {
     return {
-      ...globalSteps.value.find((step) => step.id === stepId),
+      ...globalSteps.value.find((step) => false),
       zodSchema: zodGenerator(globalSteps.value[stepId - 1]),
     };

[NoCoverage] EqualityOperator
features/users/utils/step-manager.ts:100:43
 
   const getStep = (stepId = currentStep.value) => {
     return {
-      ...globalSteps.value.find((step) => step.id === stepId),
+      ...globalSteps.value.find((step) => step.id !== stepId),
       zodSchema: zodGenerator(globalSteps.value[stepId - 1]),
     };

[NoCoverage] ArithmeticOperator
features/users/utils/step-manager.ts:101:49
   const getStep = (stepId = currentStep.value) => {
     return {
       ...globalSteps.value.find((step) => step.id === stepId),
-      zodSchema: zodGenerator(globalSteps.value[stepId - 1]),
+      zodSchema: zodGenerator(globalSteps.value[stepId + 1]),
     };
   };

[NoCoverage] BlockStatement
features/users/utils/step-manager.ts:112:34
     });*/
   };
 
-  watch(currentStep, (newVal) => {
-    console.log('currentStep', newVal);
-  });
+  watch(currentStep, (newVal) => {});
 
   return {

[NoCoverage] ConditionalExpression
features/users/utils/step-manager.ts:147:9
     .map((input) => {
       const field = input;
       switch (field.type) {
-        case 'select':
-          return {
-            [field.name]: z.string(),
-          };
+        case 'select':
         case 'number':
           return {

[NoCoverage] StringLiteral
features/users/utils/step-manager.ts:147:14
     .map((input) => {
       const field = input;
       switch (field.type) {
-        case 'select':
+        case "":
           return {
             [field.name]: z.string(),

[NoCoverage] ConditionalExpression
features/users/utils/step-manager.ts:151:9
           return {
             [field.name]: z.string(),
           };
-        case 'number':
-          return {
-            [field.name]: z.coerce.number(),
-          };
+        case 'number':
         case 'checkbox':
           return {

[NoCoverage] ConditionalExpression
features/users/utils/step-manager.ts:155:9
           return {
             [field.name]: z.coerce.number(),
           };
-        case 'checkbox':
-          return {
-            [field.name]: z.boolean(),
-          };
+        case 'checkbox':
         case 'text':
           return {

[NoCoverage] StringLiteral
features/users/utils/step-manager.ts:155:14
           return {
             [field.name]: z.coerce.number(),
           };
-        case 'checkbox':
+        case "":
           return {
             [field.name]: z.boolean(),

[NoCoverage] ConditionalExpression
features/users/utils/step-manager.ts:159:9
           return {
             [field.name]: z.boolean(),
           };
-        case 'text':
-          return {
-            [field.name]: z.string(),
-          };
+        case 'text':
         case 'email':
           return {

[NoCoverage] ConditionalExpression
features/users/utils/step-manager.ts:163:9
           return {
             [field.name]: z.string(),
           };
-        case 'email':
-          return {
-            [field.name]: z.string().email(),
-          };
+        case 'email':
         default:
           return null;

[NoCoverage] ConditionalExpression
features/users/utils/step-manager.ts:167:9
           return {
             [field.name]: z.string().email(),
           };
-        default:
-          return null;
+        default:
       }
     })

[NoCoverage] ConditionalExpression
features/users/utils/step-manager.ts:171:24
           return null;
       }
     })
-    .filter((field) => field !== null)
+    .filter((field) => true)
     .reduce((acc, curr) => ({ ...acc, ...curr }), {});
   console.log(listFields);

[NoCoverage] ArrowFunction
features/users/utils/step-manager.ts:171:13
           return null;
       }
     })
-    .filter((field) => field !== null)
+    .filter(() => undefined)
     .reduce((acc, curr) => ({ ...acc, ...curr }), {});
   console.log(listFields);

[NoCoverage] ArrowFunction
features/users/utils/step-manager.ts:172:13
       }
     })
     .filter((field) => field !== null)
-    .reduce((acc, curr) => ({ ...acc, ...curr }), {});
+    .reduce(() => undefined, {});
   console.log(listFields);
   return z.object(listFields);
