[NoCoverage] BooleanLiteral
src/pages/products/create.vue:9:23
 import { productSchema, useCreateProduct, type CreateProductForm } from '@/features/products/api/useCreateProduct';
 import { useQueryClient } from '@tanstack/vue-query';
 
-const isLoading = ref(false)
+const isLoading = ref(true)
 const error = ref<null | string>(null)
 const router = useRouter()

[NoCoverage] BlockStatement
src/pages/products/create.vue:18:44
 
 const [zodPlugin, submitHandler] = createZodPlugin(
     productSchema,
-    async (formData: CreateProductForm) => {
-        mutation.mutateAsync(formData).then((data) => {
-            router.push('/')
-        }).catch((err) => {
-            error.value = handleError(err)
-        }).finally(() => {
-            isLoading.value = false
-        })
-    }
+    async (formData: CreateProductForm) => {}
 )
 

[NoCoverage] BlockStatement
src/pages/products/create.vue:19:55
 const [zodPlugin, submitHandler] = createZodPlugin(
     productSchema,
     async (formData: CreateProductForm) => {
-        mutation.mutateAsync(formData).then((data) => {
-            router.push('/')
-        }).catch((err) => {
+        mutation.mutateAsync(formData).then((data) => {}).catch((err) => {
             error.value = handleError(err)
         }).finally(() => {

[NoCoverage] BlockStatement
src/pages/products/create.vue:21:27
     async (formData: CreateProductForm) => {
         mutation.mutateAsync(formData).then((data) => {
             router.push('/')
-        }).catch((err) => {
-            error.value = handleError(err)
-        }).finally(() => {
+        }).catch((err) => {}).finally(() => {
             isLoading.value = false
         })

[NoCoverage] BlockStatement
src/pages/products/create.vue:23:26
             router.push('/')
         }).catch((err) => {
             error.value = handleError(err)
-        }).finally(() => {
-            isLoading.value = false
-        })
+        }).finally(() => {})
     }
 )

[NoCoverage] BooleanLiteral
src/pages/products/create.vue:24:31
         }).catch((err) => {
             error.value = handleError(err)
         }).finally(() => {
-            isLoading.value = false
+            isLoading.value = true
         })
     }
