[NoCoverage] ObjectLiteral
src/pages/router.ts:10:5
 const router = createRouter({
   history: createWebHistory(),
   routes: [
-    {
-      path: '/',
-      name: 'home',
-      component: HomeView,
-    },
+    {},
     {
       path: '/auth',

[NoCoverage] StringLiteral
src/pages/router.ts:12:13
   routes: [
     {
       path: '/',
-      name: 'home',
+      name: "",
       component: HomeView,
     },

[NoCoverage] ArrayDeclaration
src/pages/router.ts:17:17
     },
     {
       path: '/auth',
-      children: [
-        {
-          path: 'login',
-          name: 'login',
-          component: () => import('./auth/login.vue'),
-        },
-        {
-          path: 'register',
-          name: 'register',
-          component: () => import('./auth/register.vue'),
-        },
-      ],
+      children: [],
     },
     {

[NoCoverage] StringLiteral
src/pages/router.ts:20:17
       children: [
         {
           path: 'login',
-          name: 'login',
+          name: "",
           component: () => import('./auth/login.vue'),
         },

[NoCoverage] ArrowFunction
src/pages/router.ts:21:22
         {
           path: 'login',
           name: 'login',
-          component: () => import('./auth/login.vue'),
+          component: () => undefined,
         },
         {

[NoCoverage] ArrowFunction
src/pages/router.ts:26:22
         {
           path: 'register',
           name: 'register',
-          component: () => import('./auth/register.vue'),
+          component: () => undefined,
         },
       ],

[NoCoverage] ObjectLiteral
src/pages/router.ts:30:5
         },
       ],
     },
-    {
-      path: '/users/create/:id/:step',
-      name: 'create_user',
-      component: () => import('./users/create/index.vue'),
-    },
+    {},
     {
       path: '/products',

[NoCoverage] StringLiteral
src/pages/router.ts:31:13
       ],
     },
     {
-      path: '/users/create/:id/:step',
+      path: "",
       name: 'create_user',
       component: () => import('./users/create/index.vue'),

[NoCoverage] ArrowFunction
src/pages/router.ts:33:18
     {
       path: '/users/create/:id/:step',
       name: 'create_user',
-      component: () => import('./users/create/index.vue'),
+      component: () => undefined,
     },
     {

[NoCoverage] StringLiteral
src/pages/router.ts:33:31
     {
       path: '/users/create/:id/:step',
       name: 'create_user',
-      component: () => import('./users/create/index.vue'),
+      component: () => import(""),
     },
     {

[NoCoverage] StringLiteral
src/pages/router.ts:42:17
       children: [
         {
           path: '',
-          name: 'products-list',
+          name: "",
           component: () => import('./products/index.vue'),
         },

[NoCoverage] ArrowFunction
src/pages/router.ts:43:22
         {
           path: '',
           name: 'products-list',
-          component: () => import('./products/index.vue'),
+          component: () => undefined,
         },
       ],

[NoCoverage] StringLiteral
src/pages/router.ts:43:35
         {
           path: '',
           name: 'products-list',
-          component: () => import('./products/index.vue'),
+          component: () => import(""),
         },
       ],
