[NoCoverage] ObjectLiteral
src/plugins/demo-plugin/index.ts:5:20
 import { vFocus } from './directives/v-focus';
 import GlobalCard from './ui/GlobalCard.vue';
 
-const demoPlugin = {
-  install(app: App<Element>, options) {
-    // configure the app
-    //  app.component('global-card', GlobalCard);
-    //app.directive('v-focus', vFocus);
-    // app.provide('key', 'value');
-    //app.provide('demoPlugin', options);
-  },
-};
+const demoPlugin = {};
 
 export default demoPlugin;
