[NoCoverage] StringLiteral
src/stories/Button.stories.ts:13:42
   // This component will have an automatically generated docsPage entry: https://storybook.js.org/docs/writing-docs/autodocs
   tags: ['autodocs'],
   argTypes: {
-    size: { control: 'select', options: ['small', 'medium', 'large'] },
+    size: { control: 'select', options: ["", 'medium', 'large'] },
     backgroundColor: { control: 'color' },
   },

[NoCoverage] ArrayDeclaration
src/stories/Button.stories.ts:13:41
   // This component will have an automatically generated docsPage entry: https://storybook.js.org/docs/writing-docs/autodocs
   tags: ['autodocs'],
   argTypes: {
-    size: { control: 'select', options: ['small', 'medium', 'large'] },
+    size: { control: 'select', options: [] },
     backgroundColor: { control: 'color' },
   },

[NoCoverage] ObjectLiteral
src/stories/Button.stories.ts:14:22
   tags: ['autodocs'],
   argTypes: {
     size: { control: 'select', options: ['small', 'medium', 'large'] },
-    backgroundColor: { control: 'color' },
+    backgroundColor: {},
   },
   args: {

[NoCoverage] BooleanLiteral
src/stories/Button.stories.ts:17:14
     backgroundColor: { control: 'color' },
   },
   args: {
-    primary: false,
+    primary: true,
     // Use `fn` to spy on the onClick arg, which will appear in the actions panel once invoked: https://storybook.js.org/docs/essentials/actions#action-args
     onClick: fn(),

[NoCoverage] ObjectLiteral
src/stories/Button.stories.ts:30:31
  * See https://storybook.js.org/docs/api/csf
  * to learn how to use render functions.
  */
-export const Primary: Story = {
-  args: {
-    primary: true,
-    label: 'Button',
-  },
-};
+export const Primary: Story = {};
 
 export const Secondary: Story = {

[NoCoverage] ObjectLiteral
src/stories/Button.stories.ts:31:9
  * to learn how to use render functions.
  */
 export const Primary: Story = {
-  args: {
-    primary: true,
-    label: 'Button',
-  },
+  args: {},
 };
 

[NoCoverage] BooleanLiteral
src/stories/Button.stories.ts:32:14
  */
 export const Primary: Story = {
   args: {
-    primary: true,
+    primary: false,
     label: 'Button',
   },

[NoCoverage] ObjectLiteral
src/stories/Button.stories.ts:38:9
 };
 
 export const Secondary: Story = {
-  args: {
-    primary: false,
-    label: 'Button',
-  },
+  args: {},
 };
 

[NoCoverage] StringLiteral
src/stories/Button.stories.ts:40:12
 export const Secondary: Story = {
   args: {
     primary: false,
-    label: 'Button',
+    label: "",
   },
 };

[NoCoverage] ObjectLiteral
src/stories/Button.stories.ts:44:29
   },
 };
 
-export const Large: Story = {
-  args: {
-    label: 'Button',
-    size: 'large',
-  },
-};
+export const Large: Story = {};
 
 export const Small: Story = {

[NoCoverage] ObjectLiteral
src/stories/Button.stories.ts:45:9
 };
 
 export const Large: Story = {
-  args: {
-    label: 'Button',
-    size: 'large',
-  },
+  args: {},
 };
 
