[NoCoverage] BooleanLiteral
src/stories/Button.vue:27:18
    */
   backgroundColor?: string,
 
-}>(), { primary: false });
+}>(), { primary: true });
 
 const emit = defineEmits<{

[NoCoverage] ArrowFunction
src/stories/Button.vue:33:26
   (e: 'click', id: number): void;
 }>();
 
-const classes = computed(() => ({
-  'storybook-button': true,
-  'storybook-button--primary': props.primary,
-  'storybook-button--secondary': !props.primary,
-  [`storybook-button--${props.size || 'medium'}`]: true,
-}));
+const classes = computed(() => undefined);
 
 const style = computed(() => ({

[NoCoverage] BooleanLiteral
src/stories/Button.vue:34:23
 }>();
 
 const classes = computed(() => ({
-  'storybook-button': true,
+  'storybook-button': false,
   'storybook-button--primary': props.primary,
   'storybook-button--secondary': !props.primary,

[NoCoverage] BooleanLiteral
src/stories/Button.vue:36:34
 const classes = computed(() => ({
   'storybook-button': true,
   'storybook-button--primary': props.primary,
-  'storybook-button--secondary': !props.primary,
+  'storybook-button--secondary': props.primary,
   [`storybook-button--${props.size || 'medium'}`]: true,
 }));

[NoCoverage] LogicalOperator
src/stories/Button.vue:37:25
   'storybook-button': true,
   'storybook-button--primary': props.primary,
   'storybook-button--secondary': !props.primary,
-  [`storybook-button--${props.size || 'medium'}`]: true,
+  [`storybook-button--${props.size && 'medium'}`]: true,
 }));
 

[NoCoverage] BooleanLiteral
src/stories/Button.vue:37:52
   'storybook-button': true,
   'storybook-button--primary': props.primary,
   'storybook-button--secondary': !props.primary,
-  [`storybook-button--${props.size || 'medium'}`]: true,
+  [`storybook-button--${props.size || 'medium'}`]: false,
 }));
 

[NoCoverage] ArrowFunction
src/stories/Button.vue:40:24
   [`storybook-button--${props.size || 'medium'}`]: true,
 }));
 
-const style = computed(() => ({
-  backgroundColor: props.backgroundColor
-}));
+const style = computed(() => undefined);
 
 const onClick = () => {

[NoCoverage] BlockStatement
src/stories/Button.vue:44:23
   backgroundColor: props.backgroundColor
 }));
 
-const onClick = () => {
-  emit("click", 1)
-};
+const onClick = () => {};
 
 </script>
