[NoCoverage] ArrowFunction
src/stories/Header.stories.ts:13:11
    */
   title: 'Example/Header',
   component: MyHeader,
-  render: (args: any) => ({
-    components: { MyHeader },
-    setup() {
-      return { args };
-    },
-    template: '<my-header :user="args.user" />',
-  }),
+  render: () => undefined,
   parameters: {
     // More on how to position stories at: https://storybook.js.org/docs/configure/story-layout

[NoCoverage] ObjectLiteral
src/stories/Header.stories.ts:13:27
    */
   title: 'Example/Header',
   component: MyHeader,
-  render: (args: any) => ({
-    components: { MyHeader },
-    setup() {
-      return { args };
-    },
-    template: '<my-header :user="args.user" />',
-  }),
+  render: (args: any) => ({}),
   parameters: {
     // More on how to position stories at: https://storybook.js.org/docs/configure/story-layout

[NoCoverage] BlockStatement
src/stories/Header.stories.ts:15:13
   component: MyHeader,
   render: (args: any) => ({
     components: { MyHeader },
-    setup() {
-      return { args };
-    },
+    setup() {},
     template: '<my-header :user="args.user" />',
   }),

[NoCoverage] ObjectLiteral
src/stories/Header.stories.ts:16:14
   render: (args: any) => ({
     components: { MyHeader },
     setup() {
-      return { args };
+      return {};
     },
     template: '<my-header :user="args.user" />',

[NoCoverage] StringLiteral
src/stories/Header.stories.ts:18:15
     setup() {
       return { args };
     },
-    template: '<my-header :user="args.user" />',
+    template: "",
   }),
   parameters: {

[NoCoverage] ObjectLiteral
src/stories/Header.stories.ts:20:15
     },
     template: '<my-header :user="args.user" />',
   }),
-  parameters: {
-    // More on how to position stories at: https://storybook.js.org/docs/configure/story-layout
-    layout: 'fullscreen',
-  },
+  parameters: {},
   args: {
     onLogin: fn(),

[NoCoverage] StringLiteral
src/stories/Header.stories.ts:22:13
   }),
   parameters: {
     // More on how to position stories at: https://storybook.js.org/docs/configure/story-layout
-    layout: 'fullscreen',
+    layout: "",
   },
   args: {

[NoCoverage] StringLiteral
src/stories/Header.stories.ts:30:10
     onCreateAccount: fn(),
   },
   // This component will have an automatically generated docsPage entry: https://storybook.js.org/docs/writing-docs/autodocs
-  tags: ['autodocs'],
+  tags: [""],
 } satisfies Meta<typeof MyHeader>;
 
