[NoCoverage] ObjectLiteral
src/stories/Page.stories.ts:6:14
 
 import MyPage from './Page.vue';
 
-const meta = {
-  title: 'Example/Page',
-  component: MyPage,
-  render: () => ({
-    components: { MyPage },
-    template: '<my-page />',
-  }),
-  parameters: {
-    // More on how to position stories at: https://storybook.js.org/docs/configure/story-layout
-    layout: 'fullscreen',
-  },
-  // This component will have an automatically generated docsPage entry: https://storybook.js.org/docs/writing-docs/autodocs
-  tags: ['autodocs'],
-} satisfies Meta<typeof MyPage>;
+const meta = {} satisfies Meta<typeof MyPage>;
 
 export default meta;

[NoCoverage] StringLiteral
src/stories/Page.stories.ts:7:10
 import MyPage from './Page.vue';
 
 const meta = {
-  title: 'Example/Page',
+  title: "",
   component: MyPage,
   render: () => ({

[NoCoverage] ArrowFunction
src/stories/Page.stories.ts:9:11
 const meta = {
   title: 'Example/Page',
   component: MyPage,
-  render: () => ({
-    components: { MyPage },
-    template: '<my-page />',
-  }),
+  render: () => undefined,
   parameters: {
     // More on how to position stories at: https://storybook.js.org/docs/configure/story-layout

[NoCoverage] ObjectLiteral
src/stories/Page.stories.ts:10:17
   title: 'Example/Page',
   component: MyPage,
   render: () => ({
-    components: { MyPage },
+    components: {},
     template: '<my-page />',
   }),

[NoCoverage] StringLiteral
src/stories/Page.stories.ts:11:15
   component: MyPage,
   render: () => ({
     components: { MyPage },
-    template: '<my-page />',
+    template: "",
   }),
   parameters: {

[NoCoverage] BlockStatement
src/stories/Page.stories.ts:26:43
 
 // More on interaction testing: https://storybook.js.org/docs/writing-tests/interaction-testing
 export const LoggedIn: Story = {
-  play: async ({ canvasElement }: any) => {
-    const canvas = within(canvasElement);
-    const loginButton = canvas.getByRole('button', { name: /Log in/i });
-    await expect(loginButton).toBeInTheDocument();
-    await userEvent.click(loginButton);
-    await expect(loginButton).not.toBeInTheDocument();
-
-    const logoutButton = canvas.getByRole('button', { name: /Log out/i });
-    await expect(logoutButton).toBeInTheDocument();
-  },
+  play: async ({ canvasElement }: any) => {},
 };
 

[NoCoverage] StringLiteral
src/stories/Page.stories.ts:28:42
 export const LoggedIn: Story = {
   play: async ({ canvasElement }: any) => {
     const canvas = within(canvasElement);
-    const loginButton = canvas.getByRole('button', { name: /Log in/i });
+    const loginButton = canvas.getByRole("", { name: /Log in/i });
     await expect(loginButton).toBeInTheDocument();
     await userEvent.click(loginButton);

[NoCoverage] StringLiteral
src/stories/Page.stories.ts:33:43
     await userEvent.click(loginButton);
     await expect(loginButton).not.toBeInTheDocument();
 
-    const logoutButton = canvas.getByRole('button', { name: /Log out/i });
+    const logoutButton = canvas.getByRole("", { name: /Log out/i });
     await expect(logoutButton).toBeInTheDocument();
   },
