[NoCoverage] BlockStatement
src/stories/Page.vue:64:23
 
 const user = ref<{ name: string } | null>(null);
 
-const onLogin = () => {
-  user.value = { name: 'Jane Doe' };
-};
+const onLogin = () => {};
 const onLogout = () => {
   user.value = null;

[NoCoverage] StringLiteral
src/stories/Page.vue:65:24
 const user = ref<{ name: string } | null>(null);
 
 const onLogin = () => {
-  user.value = { name: 'Jane Doe' };
+  user.value = { name: "" };
 };
 const onLogout = () => {

[NoCoverage] BlockStatement
src/stories/Page.vue:67:24
 const onLogin = () => {
   user.value = { name: 'Jane Doe' };
 };
-const onLogout = () => {
-  user.value = null;
-};
+const onLogout = () => {};
 const onCreateAccount = () => {
   user.value = { name: 'Jane Doe' };

[NoCoverage] BlockStatement
src/stories/Page.vue:70:31
 const onLogout = () => {
   user.value = null;
 };
-const onCreateAccount = () => {
-  user.value = { name: 'Jane Doe' };
-};
+const onCreateAccount = () => {};
 </script>
 
