[NoCoverage] BlockStatement
src/utils/handleError.ts:1:48
-export const handleError = (error: unknown) => {
-  if (error instanceof Error) {
-    return error.message;
-  } else if (typeof error === 'string') {
-    return error;
-  } else {
-    return 'Une erreur est survenue';
-  }
-};
+export const handleError = (error: unknown) => {};
 

[NoCoverage] BlockStatement
src/utils/handleError.ts:2:31
 export const handleError = (error: unknown) => {
-  if (error instanceof Error) {
-    return error.message;
-  } else if (typeof error === 'string') {
+  if (error instanceof Error) {} else if (typeof error === 'string') {
     return error;
   } else {

[NoCoverage] ConditionalExpression
src/utils/handleError.ts:2:7
 export const handleError = (error: unknown) => {
-  if (error instanceof Error) {
+  if (true) {
     return error.message;
   } else if (typeof error === 'string') {

[NoCoverage] EqualityOperator
src/utils/handleError.ts:4:14
 export const handleError = (error: unknown) => {
   if (error instanceof Error) {
     return error.message;
-  } else if (typeof error === 'string') {
+  } else if (typeof error !== 'string') {
     return error;
   } else {

[NoCoverage] BlockStatement
src/utils/handleError.ts:4:41
 export const handleError = (error: unknown) => {
   if (error instanceof Error) {
     return error.message;
-  } else if (typeof error === 'string') {
-    return error;
-  } else {
+  } else if (typeof error === 'string') {} else {
     return 'Une erreur est survenue';
   }

[NoCoverage] BlockStatement
src/utils/handleError.ts:6:10
     return error.message;
   } else if (typeof error === 'string') {
     return error;
-  } else {
-    return 'Une erreur est survenue';
-  }
+  } else {}
 };
 
