[Killed] BooleanLiteral
src/composables/useFetch.ts:4:30
 import { onMounted, ref, type Ref } from 'vue';
 
 const useFetch = <T>(url: string) => {
-  const isLoading: Ref = ref(false);
+  const isLoading: Ref = ref(true);
   const data = ref<T[] | null>(null);
   const error = ref<string | null>(null);
killedBy: useFetch composable should initialize with default values
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/composables/useFetch.ts:8:19
   const data = ref<T[] | null>(null);
   const error = ref<string | null>(null);
 
-  onMounted(() => {
-    isLoading.value = true;
-    error.value = null;
-
-    fetch(url)
-      .then((response) => response.json())
-      .then((response) => {
-        console.log(data);
-        data.value = response.results;
-      })
-      .catch((err: unknown) => {
-        if (err instanceof Error) {
-          error.value = err.message;
-        } else if (typeof err === 'string') {
-          error.value = err;
-        } else {
-          error.value = 'Une erreur est survenue';
-        }
-      })
-      .finally(() => {
-        isLoading.value = false;
-      });
-  });
+  onMounted(() => {});
 
   return {
killedBy: useFetch composable should fetch data successfully
statusReason: expected null to deeply equal [ { id: 1, name: 'Test Item' } ]

[Killed] ArrowFunction
src/composables/useFetch.ts:13:13
     error.value = null;
 
     fetch(url)
-      .then((response) => response.json())
+      .then(() => undefined)
       .then((response) => {
         console.log(data);
killedBy: useFetch composable should fetch data successfully
statusReason: expected null to deeply equal [ { id: 1, name: 'Test Item' } ]

[Killed] BlockStatement
src/composables/useFetch.ts:14:27
 
     fetch(url)
       .then((response) => response.json())
-      .then((response) => {
-        console.log(data);
-        data.value = response.results;
-      })
+      .then((response) => {})
       .catch((err: unknown) => {
         if (err instanceof Error) {
killedBy: useFetch composable should fetch data successfully
statusReason: expected null to deeply equal [ { id: 1, name: 'Test Item' } ]

[Killed] BlockStatement
src/composables/useFetch.ts:19:35
         data.value = response.results;
       })
       .catch((err: unknown) => {
-        if (err instanceof Error) {
-          error.value = err.message;
-        } else if (typeof err === 'string') {
+        if (err instanceof Error) {} else if (typeof err === 'string') {
           error.value = err;
         } else {
killedBy: useFetch composable should handle fetch errors
statusReason: expected null to be 'Fetch failed' // Object.is equality

[Killed] ConditionalExpression
src/composables/useFetch.ts:21:20
       .catch((err: unknown) => {
         if (err instanceof Error) {
           error.value = err.message;
-        } else if (typeof err === 'string') {
+        } else if (true) {
           error.value = err;
         } else {
killedBy: useFetch composable should handle generic errors gracefully
statusReason: expected null to be 'Une erreur est survenue' // Object.is equality
