[Killed] BlockStatement
src/utils/withSetup.ts:4:61
 import type { App } from 'vue';
 import { createApp } from 'vue';
 
-export function withSetup<T>(composable: () => T): [T, App] {
-  let result: T = null as unknown as T;
-  const app = createApp({
-    setup() {
-      result = composable();
-      return () => {};
-    },
-  });
-
-  app.mount(document.createElement('div'));
-  return [result, app];
-}
+export function withSetup<T>(composable: () => T): [T, App] {}
 
killedBy: useFetch composable should fetch data successfully
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ObjectLiteral
src/utils/withSetup.ts:6:25
 
 export function withSetup<T>(composable: () => T): [T, App] {
   let result: T = null as unknown as T;
-  const app = createApp({
-    setup() {
-      result = composable();
-      return () => {};
-    },
-  });
+  const app = createApp({});
 
   app.mount(document.createElement('div'));
killedBy: useFetch composable should fetch data successfully
statusReason: Cannot read properties of null (reading 'isLoading')

[Killed] BlockStatement
src/utils/withSetup.ts:7:13
 export function withSetup<T>(composable: () => T): [T, App] {
   let result: T = null as unknown as T;
   const app = createApp({
-    setup() {
-      result = composable();
-      return () => {};
-    },
+    setup() {},
   });
 
killedBy: useFetch composable should fetch data successfully
statusReason: Cannot read properties of null (reading 'isLoading')

[Killed] StringLiteral
src/utils/withSetup.ts:13:36
     },
   });
 
-  app.mount(document.createElement('div'));
+  app.mount(document.createElement(""));
   return [result, app];
 }
killedBy: useFetch composable should fetch data successfully
statusReason: "" did not match the Name production
