[Killed] ObjectLiteral
src/pages/index.vue:12:20
 
 
 
-const person = ref({
-    name: 'John',
-    age: 25
-})
+const person = ref({})
 
 </script>
killedBy: PersonComponent.vue renders the component with initial values
statusReason: expected '' to contain '25'
