[NoCoverage] StringLiteral
src/pages/router.ts:18:35
         {
           path: 'login',
           name: 'login',
-          component: () => import('./auth/login.vue'),
+          component: () => import(""),
         },
         {

[NoCoverage] ObjectLiteral
src/pages/router.ts:31:9
       path: '/products',
       meta: { layout: 'LoggedLayout' },
       children: [
-        {
-          path: '',
-          name: 'products-list',
-          component: () => import('./products/index.vue'),
-        },
+        {},
       ],
     },
